Week6/Lesson_AuthenticationAuthorization/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "suckit@mailinator.com"]]
---
	def create
		user_confirm = User.find_by(email: params[:email])