Week6/Lesson_AuthenticationAuthorization/app/controllers/users_controller.rb

	def index
		# get_current_user		# => Refactored with before_action call.
		@users = User.all
---
SELECT "users".* FROM "users"

	def create
		user = User.new(user_params)
		if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)